DataProcessors/АР17_ИзменитьДатуВозврата.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>АР17_ИзменитьДатуВозврата</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ШК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВозврата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/АР_ВозвращенныеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_ВозвращенныеДокументы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_НачислениеАренднойПлаты</v8:Type>
						<v8:Type>cfg:DocumentRef.СчетФактураВыданный</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ИнформационныйДокумент</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_ДополнительноеСоглашение</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_РасторжениеДоговораАренды</v8:Type>
						<v8:Type>cfg:DocumentRef.АР17_СчетНаАренду</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаВозвратаАрендуемогоПомещения</v8:Type>
						<v8:Type>cfg:DocumentRef.АР_АктПриемаПередачиПомещенияВАренду</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/АР_ШтрихКоды.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>АР_ШтрихКоды</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ШтрихКод</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.АР17_ЗаключениеАгентскогоДоговора</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/АР17_ИзменитьДатуВозврата/Forms/Форма/Ext/Form/Module.bsl
&НаСервере
Процедура ИзменитьНаСервере()
	// + NAI Becar Комментирование Смирнов А.А. от 10.05.2018 14:38
	НаборЗаписей = РегистрыСведений.АР_ВозвращенныеДокументы.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Документ.Установить(Объект.СсылкаНаОбъект);
	Запись = НаборЗаписей.Добавить();
	Запись.Документ = Объект.СсылкаНаОбъект;
	Запись.Дата = Объект.ДатаВозврата;
	НаборЗаписей.Записать();
	Об = Объект.СсылкаНаОбъект.ПолучитьОбъект();
	Об.Комментарий = Об.Комментарий + "; изменил " + ПользователиКлиентСервер.ТекущийПользователь() + " " + ТекущаяДата();
	Об.Записать();
	// - NAI Becar Комментирование Смирнов А.А.
КонецПроцедуры

&НаКлиенте
Процедура Изменить(Команда)
	ИзменитьНаСервере();
КонецПроцедуры


&НаСервере
Процедура НайтиДок()
	Запрос = Новый Запрос;
	Запрос.Текст=
	"ВЫБРАТЬ
	|	ШтрихКоды.ШтрихКод,
	|	ШтрихКоды.СсылкаНаОбъект
	|ИЗ
	|	РегистрСведений.АР_ШтрихКоды КАК ШтрихКоды
	|ГДЕ
	|	ШтрихКоды.ШтрихКод = &ШтрихКод";
	//Запрос.УстановитьПараметр("СсылкаНаОбъект",Ссылка);
	Запрос.УстановитьПараметр("ШтрихКод",Объект.ШК);
	Выборка = Запрос.Выполнить().Выбрать();
	
	//Если Выборка.Следующий() Тогда
	//	Возврат СокрЛП(Выборка.СсылкаНаОбъект);
	//Иначе
	//	Возврат "Документ не найден";
	//КонецЕсли;
	
	Если Выборка.Следующий() Тогда
		Объект.СсылкаНаОбъект = Выборка.СсылкаНаОбъект;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура ШКПриИзменении(Элемент)
	НайтиДок();
	Если ПустаяСсылка(Объект.СсылкаНаОбъект) Тогда
		ЭтаФорма.Элементы.Декорация1.Заголовок = "" + Объект.СсылкаНаОбъект; 
	Иначе
		ЭтаФорма.Элементы.Декорация1.Заголовок = "" + "Документ не найден"; 
	КонецЕсли;	
КонецПроцедуры

Функция ПустаяСсылка(СсылкаНаОбъект)
	Если СсылкаНаОбъект <> Документы.АР17_НачислениеАренднойПлаты.ПустаяСсылка() Тогда
		Возврат Истина;
	Иначе
		Возврат Ложь;
	КонецЕсли;	
КонецФункции
